
#Размер скидки на продукты определен следующим образом: при покупке до 500 р.
#скидка составит 2%; при покупке от 500 р. до 1000 р. скидка составит 3%; при
#покупке от 1000 р. до 1500 р. скидка составит 4%; при покупке от 1500 р. до 2000 р.
#скидка составит 5%. Составить программу определяющую размер скидки в
#зависимости от потраченной суммы.

try:
  S = float(input("Введите сумму покупки (руб.): "))
except ValueError as error:
  print(f"[Ошибка] Некорректные данные: {error}")
else:

  if S < 0:
    print("Введите положительное число")
  else:
    if S < 500:
      I = 2
    elif S < 1000:
      I = 3
    elif S < 1500:
      I = 4
    else:
      I = 5
    print(f"Размер вашей скидки составляет: {I}%")
