#Вариант 3. Скорость лодки в стоячей воде V км/ч, скорость течения реки U км/ч 
#(U < V). Время движения лодки по озеру T 1 ч, а по реке (против течения) — T2 ч. Определить
#путь S, пройденный лодкой (путь = время • скорость). Учесть, что при движении против
#течения скорость лодки уменьшается на величину скорости течения.

v = int(input("Введите скорость лодки в стоячей воде "))
u = int(input("Введите скорость течения реки "))
t1 = int(input("Введите время движения по озеру "))
t2 = int(input("Введите время движения по реке "))
if u < v:
    s1 = t1 * v
    s2 = t2 * (v - u)
    s = s1 + s2
    print("Общий путь равен:", s,"км")
else:
    print("не то тыкаешь")
    exit()