#Вариант 3. Скорость лодки в стоячей воде V км/ч, скорость течения реки U км/ч 
#(U < V). Время движения лодки по озеру T 1 ч, а по реке (против течения) — T2 ч. Определить
#путь S, пройденный лодкой (путь = время • скорость). Учесть, что при движении против
#течения скорость лодки уменьшается на величину скорости течения.

while True:
    try:
        
        v = float(input("Введите скорость лодки в стоячей воде V (км/ч): "))
        u = float(input("Введите скорость течения реки U (км/ч): "))
        t1 = float(input("Введите время движения по озеру T1 (ч): "))
        t2 = float(input("Введите время движения по реке T2 (ч): "))   
        break
        
    except ValueError :

        print(f"[Ошибка] Некорректные данные:")
        print("Пожалуйста, убедитесь, что вы вводите числа, и скорость лодки больше скорости течения.")
        
if u >= v:
    print("Скорость течения реки (U) должна быть меньше скорости лодки (V).")
else:
    
    s1 = t1 * v          
    s2 = t2 * (v - u)    
    s = s1 + s2  
    print(f"Общий пройденный путь S: {s}км")


